content/notes/vectors.org
#+title: Vectors

* Vectors
:PROPERTIES:
:CUSTOM_ID: vectors
:END:
** Vector Spaces
:PROPERTIES:
:CUSTOM_ID: vector-spaces
:END:
- Addition:
  \([x_1, x_2, x_3] + [y_1, y_2, y_3] = [x_1 + y_1, x_2 + y_2, x_3 + y_3]\)
- Scalar multiplication: \(t[x_1, x_2, x_3] = [tx_1, tx_2, tx_3]\)

Consider that \(z_i = x_i + y_i\), a vector space is then a collection
of objects that can be added to each other and multiplied by numbers,
subjet to certain laws of algebra.

#+begin_example
Lemma: If $W$ is a nonempty subset of vector space $V$ which is closed under the operations of $V$, then $W$ is itself a vector space.
#+end_example

Furthermore, \(W\) from the lemma above is known as a /subspace/. Any
subspace of \(\mathbb{R}^{A)\) is called a /function space/. In other
words, a function space is a collection of real-valued functions on a
common domain.

** Skew Symmetric Matrix
:PROPERTIES:
:CUSTOM_ID: skew-symmetric-matrix
:END:
A skew symmetric matrix is denoted as \(A_{\times}\) or \((A\times)\).
This indicates a skew symmetric matrix that is denoted as:

\[
A_{\times} =
\begin{bmatrix}
    0    & -A_3 & A_2 \\
    A_3  & 0    & -A_1 \\
    -A_2 & A_1  & 0 \\
\end{bmatrix}
\]

for a \(3\times 3\) matrix.

* References
:PROPERTIES:
:CUSTOM_ID: references
:END:
- [[https://math.stackexchange.com/questions/2248413/skew-symmetric-matrix-of-vector.md][Skew
  Symmetric Matrix]]
