docs/vectors.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-06-05 Mon 19:13 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vectors</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav><a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="class.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Vectors</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#vectors">1. Vectors</a>
<ul>
<li><a href="#vector-spaces">1.1. Vector Spaces</a></li>
<li><a href="#skew-symmetric-matrix">1.2. Skew Symmetric Matrix</a></li>
</ul>
</li>
<li><a href="#references">2. References</a></li>
</ul>
</div>
</nav>

<div id="outline-container-vectors" class="outline-2">
<h2 id="vectors"><span class="section-number-2">1.</span> Vectors</h2>
<div class="outline-text-2" id="text-vectors">
</div>
<div id="outline-container-vector-spaces" class="outline-3">
<h3 id="vector-spaces"><span class="section-number-3">1.1.</span> Vector Spaces</h3>
<div class="outline-text-3" id="text-vector-spaces">
<ul class="org-ul">
<li>Addition:
\([x_1, x_2, x_3] + [y_1, y_2, y_3] = [x_1 + y_1, x_2 + y_2, x_3 + y_3]\)</li>
<li>Scalar multiplication: \(t[x_1, x_2, x_3] = [tx_1, tx_2, tx_3]\)</li>
</ul>

<p>
Consider that \(z_i = x_i + y_i\), a vector space is then a collection
of objects that can be added to each other and multiplied by numbers,
subjet to certain laws of algebra.
</p>

<pre class="example" id="orgc6c248b">
Lemma: If $W$ is a nonempty subset of vector space $V$ which is closed under the operations of $V$, then $W$ is itself a vector space.
</pre>

<p>
Furthermore, \(W\) from the lemma above is known as a <i>subspace</i>. Any
subspace of \(\mathbb{R}^{A)\) is called a <i>function space</i>. In other
words, a function space is a collection of real-valued functions on a
common domain.
</p>
</div>
</div>

<div id="outline-container-skew-symmetric-matrix" class="outline-3">
<h3 id="skew-symmetric-matrix"><span class="section-number-3">1.2.</span> Skew Symmetric Matrix</h3>
<div class="outline-text-3" id="text-skew-symmetric-matrix">
<p>
A skew symmetric matrix is denoted as \(A_{\times}\) or \((A\times)\).
This indicates a skew symmetric matrix that is denoted as:
</p>

<p>
\[
A<sub>&times;</sub> =
</p>
\begin{bmatrix}
    0    & -A_3 & A_2 \\
    A_3  & 0    & -A_1 \\
    -A_2 & A_1  & 0 \\
\end{bmatrix}
<p>
\]
</p>

<p>
for a \(3\times 3\) matrix.
</p>
</div>
</div>
</div>

<div id="outline-container-references" class="outline-2">
<h2 id="references"><span class="section-number-2">2.</span> References</h2>
<div class="outline-text-2" id="text-references">
<ul class="org-ul">
<li><a href="https://math.stackexchange.com/questions/2248413/skew-symmetric-matrix-of-vector.md">Skew
Symmetric Matrix</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-06-05 Mon 19:13</p>
</div>
</body>
</html>
